Repository: hojalatheef/typo3-13lts
Catalog: Source/Extension/jwsitepackage13/Resources/Private/Language/*.locallang.xlf
Languages: de

# jwsitepackage13.companyname
source: Company Name: Name used in the copyright info, f.e. in the footer
de: Firmenname: Der Name wird fuer die Copyright-Info genutzt, z.B. im Footer

# jwsitepackage13.compressCss
source: Compress CSS:Activate compression/minification of CSS files
de: Compress CSS: Komprimierung/Minifizierung von CSS-Dateien aktivieren

# jwsitepackage13.compressJs
source: Compress JavaScript: Activate compression/minification of JavaScript files
de: Compress JavaScript: Komprimierung/Minifizierung von JavaScript-Dateien aktivieren

# jwsitepackage13.concatenateCss
source: Concatenate CSS: Activate concatenation of multiple CSS files to one single file
de: Concatenate CSS: Zusammenfassung mehrerer CSS-Dateien zu einer einzelnen aktivieren

# jwsitepackage13.concatenateJs
source: Concatenate JavaScript: Activate concatenation of multiple JavaScript files to one single file
de: Concatenate JavaScript: Zusammenfassung mehrerer JavaScript-Dateien zu einer einzelnen aktivieren

# jwsitepackage13.usePrism
source: use Prism to layout code snippets on website
de: Code Schnipsel auf der Webseite optisch hervorgehoben ausgeben

# jwsitepackage13.logo
source: Logo: Path to an image file used as logo in the header of the website, f.e. fileadmin/images/my_bgr.jpg, or EXT:myext/Resources/Public/Images/my_bgr.jpg
de: Logo: Pfad zu einer Bilddatei, die als Logo im Kopfbereich der Seite genutzt wird, z.B. fileadmin/images/my_bgr.jpg, oder EXT:myext/Resources/Public/Images/my_bgr.jpg

# jwsitepackage13.logoHeight
source: Logo Height: Rendered height of file in px. Visual height is defined in css
de: Höhe der Logodatei im Header: Gerenderte Höhe der Datei in px. Visuelle Höhe ist in CSS definiert

# jwsitepackage13.headerFixed
source: Fixed Header: Header stays visible when scrolling.
de: Fester Headerbereich: Kopfbereich bleibt sichtbar beim Scrollen.

# jwsitepackage13.fadeInContent
source: Fade in Content Elements: Content elements get visible when scrolling.
de: Einblenden der Inhaltselemente: Die Inhaltselemente werden beim Scrollen sichtbar.

# jwsitepackage13.heroTextMaxLength
source: Maximum amount of characters for bodytext on hero image
de: Maximale Buchstabenanzahl für Text auf Heroimage

# jwsitepackage13.metaId
source: Meta ID:ID of the starting page of the meta navigation
de: Meta ID:ID der Ausgangsseite der Meta-Navigation

# jwsitepackage13.rootId
source: Root ID:ID of the root page
de: Root ID:ID der Root-Seite

# jwsitepackage13.searchResultId
source: Search Result ID:ID of the page for search results
de: Search Result ID:ID der Seite mit den Suchergebnissen

# jwsitepackage13.searchFormId
source: Search Form ID:ID of the search form content element
de: Search Form ID:ID des Inhaltselements des Such-Formulars

# jwsitepackage13.matomourl
source: Address of the Matomo installation:Insert the URL of your Matomo installation (f.e. matomo.domain.com or domain.com/matomo, without http or https and without trailing slash!)
de: Adresse der Matomo-Installation:Fügen Sie die URL Ihrer Matomo-Installation ein (z.B. matomo.domain.de oder domain.de/matomo, ohne http oder https und ohne abschließenden Schrägstrich!)

# jwsitepackage13.matomoSiteId
source: ID of the website:Insert the ID of the website you want to monitor. You can find it in the Matomo settings (Administration -> Websites -> Manage).
de: ID der Website:Fügen Sie die ID der zu überwachenden Website ein. Sie finden diese in den Einstellungen von Matomo (Administration -> Websites -> verwalten)

# jwsitepackage13.pageTitleFirst
source: Print the page title first in title-Tag:TYPO3 by default prints a title tag in the format “website:page title”. If pageTitleFirst is set then the page title will be printed IN FRONT OF the template title. So it will look like “page title: website”.
de: Ausgabe des Seitentitels zuerst im Titel-Tag:TYPO3 gibt standardmäßig ein Titel-Tag im Format "Website:Seitentitel" aus. Wenn pageTitleFirst gesetzt ist, wird der Seitentitel VOR dem Template-Titel ausgegeben. Die Ausgabe wird so aussehen: "Seitentitel: Website".

# jwsitepackage13.customsubcategory.klaro
source: Settings for the Klaro consent management tool
de: Einstellungen für das Klaro Consent Management Tool

# jwsitepackage13.showKlaro
source: Show Consent Manager:Displays a window in which the website visitor can agree or decline the use of cookies
de: Consent Manager anzeigen:Zeigt ein Fenster an, in dem der Besucher der Website der Nutzung von Cookies zustimmen oder diese ablehnen kann

# jwsitepackage13.mustConsent
source: Visitor action required:If this checkbox is active, the visitor must decide whether to accept or reject cookies before the website can be used. If the checkbox is deactivated, the visitor can use the website even without accepting or rejecting cookies.
de: Besucheraktion erforderlich:Ist diese Checkbox aktiv, muss der Besucher entscheiden, ob er Cookies zustimmt oder sie ablehnt, bevor die Website genutzt werden kann. Ist die Checkbox deaktiviert, kann der Benutzer die Website auch ohne Zustimmung oder Ablehnung nutzen.

# jwsitepackage13.privacyPolicyUid
source: Privacy page ID:Enter the ID of the privacy page here
de: ID der Datenschutzseite:Hier die ID der Seite mit der Datenschutzerklärung eintragen

# jwsitepackage13.gaTrackingId
source: Tracking ID of Google Analytics:If you use Google Analytics, enter the ID of your property here. (Example: GA4-123456-7)
de: Tracking ID von Google Analytics:Falls Sie Google Analytics verwenden, geben Sie hier die ID Ihrer Property ein. (Beispiel: GA4-123456-7)

# jwsitepackage13.gaPath
source: Path of the Google Analytics Cookies:Usually the entry / is sufficient here
de: Pfad der Google Analytics Cookies:In der Regel reicht hier die Angabe /

# jwsitepackage13.gaDomain
source: Domain of this website: To ensure that cookies can be deleted correctly, it is necessary to specify the domain. The domain must be specified in the form 'domain.tld', without www, without http and without /!
de: Domain dieser Website: Damit Cookies auch korrekt wieder gelöscht werden können, ist die Angabe der Domain notwendig. Die Domain muss in der Form 'domain.tld' angegeben werden, ohne www, ohne http und ohne /!

# jwsitepackage13.fbp
source: Facebook Pixel: If you use the Facebook pixel, enter the pixel ID here (you can find it on https://business.facebook.com/events_manager/pixel).
de: Facebook Pixel: Falls Sie den Facebook-Pixel nutzen, geben Sie hier die Pixel-ID ein (einsehbar unter https://business.facebook.com/events_manager/pixel)

# jwsitepackage13.useTwitter
source: Twitter: Enable this checkbox if you embed Twitter widgets on your website, for example a timeline. Note: the JavaScript must be adapted according to our documentation, so that it is only executed after the website visitor has given his or her consent!
de: Twitter: Aktivieren sie diese Checkbox, wenn Sie Widgets von Twitter auf Ihrer Website einbetten, zum Beispiel eine Timeline. Beachten: das JavaScript muss entsprechend unserer Dokumentation angepasst werden, damit es erst nach Zustimmung des Website-Besuchers ausgeführt wird!

# jwsitepackage13.externalMedia
source: Use of external media: Activate this checkbox if you include videos from YouTube or Vimeo. Attention: the extension "video_shariff" should be activated!
de: Nutzung externer Medien: Aktivieren Sie diese Checkbox, wenn Sie Videos von YouTube oder Vimeo einbinden. Achtung: die Extension "video_shariff" sollte unbedingt aktiviert sein!

# jwsitepackage13.iconSquare
source: App-/FavIcon Square: Path to an image, which is used as Favicon in browsers and as touch icons for smartphones and Tablets. You need 2 variants of this icon to cover all devices, this one has to be square.
de: App-/Favicon Quadratisch: Pfad zu einer Bilddatei, die als Favicon in Browsern und TouchIcon für Smartphones und Tablets genutzt wird. Sie benötigen 2 Varianten des Bildes, um möglichst viele Geräte abzudecken, dieses Bild muss quadratisch sein.

# jwsitepackage13.iconWide
source: App-/FavIcon Wide: Path to a second image, which is used as Favicon in browsers and as touch icons for smartphones and Tablets. This variant need an aspect ratio of 31:15, for example: width 310px, height 150px.
de: App-/FavIcon Breite: Pfad zu einer zweiten Bilddatei, die als Favicon in Browsern und TouchIcon für Smartphones und Tablets genutzt wird. Diese Variante benötigt ein Seitenverhältnis von 31:15, zum Beispiel: Breite 310 px, Höhe 150 px.

# jwsitepackage13.showRootline
source: Show rootline: If set, the rootline (breadcrumb) navigation on subpages is shown.
de: Rootline anzeigen: Wenn aktiviert, wird die Brotkrumen (Rootline) Navigation auf Unterseiten angezeigt.

# jwsitepackage13.showLang
source: Show language menu: Turn on and off the language menu.
de: Sprachmenü anzeigen: Anzeige des Sprachmenüs ein-/ausschalten

# jwsitepackage13.showSearch
source: Show search box: Turn on and off the search box in the header.
de: Suchfeld anzeigen: Anzeige des Suchfeldes im Kopfbereich ein-/ausschalten

# jwsitepackage13.menuType
source: Navigation type: Select position (vertical/horizontal) of the main navigation
de: Art der Navigation: Wählen Sie die Position (waagerecht/horizontal) der Navigation aus

# jwsitepackage13.menuTheme
source: Navigation type: Select the style of the main navigation
de: Typ der Navigation: Wählen Sie den Stil der Navigation aus

# jwsitepackage13.newsStartingPoints
source: Page IDs news storage: Comma separated list of page IDs with news records (default value, can be overwritten in the news plugins)
de: Page IDs News-Storage: Kommaseparierte Liste von IDs der Seiten, auf der News-Artikel gespeichert sind (Standardwert, kann in den Plugins überschrieben werden)

# jwsitepackage13.newsDetailPid
source: Page ID news detail page: ID of the page with the news plugin for the detail view (default value, can be overwritten in the news plugins)
de: Page ID News-Detailseite: ID der Seite mit der News-Detailansicht (Standardwert, kann in den Plugins überschrieben werden)

# jwsitepackage13.newsListPid
source: Page ID news list page: ID of the page with the news plugin for the list view (default value, can be overwritten in the news plugins)
de: Page ID News-Listenseite: ID der Seite mit der News-Listenansicht (Standardwert, kann in den Plugins überschrieben werden)

# jwsitepackage13.footerContentUid
source: Page ID for footer content: ID of the page, where the content for the footer of the website is stored
de: Page ID Seite Footer Inhalte: ID der Seite, welche die Inhalte für den Footer enthält

# jwsitepackage13.metaMenuUid
source: Page ID of starting point for meta navigation: ID of the folder, under which the pages for the meta navigation are stored
de: Page ID Ordner Meta-Navigation:ID des Ordners, der die Seiten für die Meta-Navigation enthält

# jwsitepackage13.customsubcategory.meta
source: Settings for meta navigation
de: Angaben zur Meta-Navigation

# jwsitepackage13.customsubcategory.menu
source: Settings for navigation
de: Einstellungen für Navigation

# jwsitepackage13.customsubcategory.content
source: Page IDs
de: Seiten-IDs

# jwsitepackage13.customsubcategory.basic
source: Basic settings
de: Grundeinstellungen

# jwsitepackage13.customsubcategory.cookies
source: Cookies and privacy
de: Cookies und Datenschutz

# jwsitepackage13.customsubcategory.seo
source: SEO
de: Suchmaschinenoptimierung (SEO)

# jwsitepackage13.customsubcategory.rss
source: RSS feed for News
de: RSS Feed für News

# jwsitepackage13.useRss
source: Output of a RSS feed for news articles
de: Ausgabe eines RSS Feeds für News-Artikel

# jwsitepackage13.rssTitle
source: Title of the RSS feed
de: Titel des RSS Feeds

# jwsitepackage13.rssDescription
source: Description of the RSS feed
de: Beschreibung des RSS Feeds

# jwsitepackage13.rssLink
source: URL of the main domain of the RSS feed
de: URL der Hauptdomain des RSS Feeds

# jwsitepackage13.rssIcon
source: RSS Icon with Social Media Icons Content Element
de: Ausgabe des RSS Icons mit den Social Media Icons als Inhaltselement

# tt_content.layout.100
source: Colored Box
de: Farbige Box

# tt_content.layout.200
source: Gallery with square thumbnails
de: Galerie mit quadratischen Vorschaubildern

# tt_content.layout.251
source: Page preview 4 columns with image
de: Seitenvorschau mehrspaltig, mit Navigationsbild

# tt_content.layout.261
source: Social Media Links from Pages
de: Social Media Links von Seiten

# tt_content.layout.300
source: Columns with same height
de: Spalten mit gleicher Höhe

# tt_content.heroimage.layout.0
source: Dark text, no background
de: Dunkler Text ohne Hintergrund

# tt_content.layout.400
source: Dark text on light background
de: Dunkler Text auf hellem Hintergrund

# tt_content.layout.401
source: Light text, no background
de: Heller Text ohne Hintergrund

# tt_content.layout.402
source: Light text on dark background
de: Heller Text auf dunklem Hintergrund

# news.template.1
source: Latest news
de: Neueste Meldungen

# news.template.2
source: Latest news, Card View
de: Neueste Meldungen, Kartenansicht

# widgets.jwspinfo.button.label
source: Open Sitepackage Information
de: Information zum Sitepackage öffnen

# widgets.jwspinfo.title
source: Documentation of the TYPO3 V13 JW Sitepackage
de: Dokumentation zum TYPO3 V13 JW Sitepackage

# widgets.jwspinfo.longdesc
source: On our website you will find detailed documentation about the sample project. In several text and video tutorials we show how you can adapt this template to your requirements.
de: Auf unserer Website finden Sie eine ausührliche Dokumentation zum Musterprojekt. In mehreren Text- und Videoanleitungen zeigen wir, wie Sie diese Vorlage an Ihre Anforderungen anpassen können.

# widgets.jwspinfo.shortdesc
source: Notes on the documentation of the template project
de: Hinweise zur Dokumentation des Musterprojekts

# col-content-headermedia
source: Header for media, whole browser width
de: Kopfbereich für Medien, ganze Browserbreite

# searchbuttonlink
source: Open/Close Search
de: Suche öffnen/schließen

source: Skip to content
de: Zum Inhalt springen

# totop
source: Scroll to Top
de: Nach oben scrollen

source: by
de: Foto

# ctype.heroimage.title
source: Hero Image with Text
de: Hero Bild mit Text

# ctype.heroimage.decription
source: Text positioned over Image
de: Text auf Bild positioniert

# cropVariantDefault
source: Default Desktop
de: Standard Desktop

# cropVariantFree
source: Free
de: Frei

source: Search
de: Suche

# belayout-1colhero
source: One Column Layout with Hero Image
de: Einspaltiges Layout mit Hero Bild

# belayout-3col
source: Three Column Layout
de: Dreispaltiges Layout

# belayout-2col
source: Two Column Layout
de: Zweispaltiges Layout

# belayout-1col
source: One Column Layout
de: Einspaltiges Layout

# belayout-footer
source: Footer Layout, 3 columns
de: Layout Fusszeile, 3-spaltig

# belayout-footer-1col
source: Footer Layout, 1 column
de: Layout Fusszeile, 1-spaltig

# belayout-footer-2col
source: Footer Layout, 2 columns
de: Layout Fusszeile, 2-spaltig

# col-content-top
source: Top Content 100%
de: Inhaltsbereich oben 100%

# col-content-main
source: Main Content
de: Hauptinhalt

# col-content-bottom
source: Content Bottom 100%
de: Inhaltsbereich unten 100%

# col-aside
source: Content Aside
de: Randbereich

# col-stage
source: Content Stage
de: Bühne

# col-content-left50
source: Content Left 50%
de: Inhaltsbereich links 50%

# col-content-right50
source: Content Right 50%
de: Inhaltsbereich rechts 50%

# col-content-left33
source: Content Left 33%
de: Inhaltsbereich links 33%

# col-content-middle33
source: Content Middle 33%
de: Inhaltsbereich mitte 33%

# col-content-right33
source: Content Right 33%
de: Inhaltsbereich rechts 33%

# ctype.col-2.title
source: 2 Column Container
de: 2-spaltiger Container

# ctype.col-2.desc
source: Option to insert 2 columns within an existing column
de: Option zwei Spalten innerhalb einer Layoutspalte einzufügen

# ctype.col-3.title
source: 3 Column Container
de: 3-spaltiger Container

# ctype.col-3.desc
source: Option to insert 3 columns within an existing column
de: Option drei Spalten innerhalb einer Layoutspalte einzufügen

# ctype.col-4.title
source: 4 Column Container
de: 4-spaltiger Container

# ctype.col-4.desc
source: Option to insert 4 columns within an existing column
de: Option vier Spalten innerhalb einer Layoutspalte einzufügen

# colpos-201
source: Container Column 1
de: Container Spalte 1

# colpos-202
source: Container Column 2
de: Container Spalte 2

# colpos-301
source: Container Column 1
de: Container Spalte 1

# colpos-302
source: Container Column 2
de: Container Spalte 2

# colpos-303
source: Container Column 3
de: Container Spalte 3

# colpos-401
source: Container Column 1
de: Container Spalte 1

# colpos-402
source: Container Column 2
de: Container Spalte 2

# colpos-403
source: Container Column 3
de: Container Spalte 3

# colpos-404
source: Container Column 4
de: Container Spalte 4

# header1
source: h1 - Page header
de: h1 - Seitenueberschrift

# header2
source: h2 - Theme headline
de: h2 - Themenueberschrift

# header3
source: h3 - Headline Level 3
de: h3 - Ueberschrift 3. Ordnung

# header4
source: h4 - Headline Level 4
de: h4 - Ueberschrift 4. Ordnung

# header5
source: h5 - Headline Level 5
de: h5 - Ueberschrift 5. Ordnung

# infobox
source: Highlighted Info Box
de: Info Box

# tt_content.frameclass.collapsemobile
source: Content collapsed in mobile view
de: Inhalt nur mobil zusammengeklappt

# tt_content.frameclass.collapse
source: Content collapsed
de: Inhalt ausklappbar

# tt_content.frameclass.heroimage.default
source: Textbox left
de: Textblock links

# tt_content.frameclass.center
source: Textbox center
de: Textblock mittig

# tt_content.frameclass.right
source: Textbox right
de: Textblock rechts
